<a href="https://colab.research.google.com/github/Ariefsuhanda/Latihan-Python/blob/main/Hierarchy_Indexing_pada_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Import pandas dan numpy dulu
import pandas as pd
import numpy as np

In [2]:
# Kita mulai dengan cara yang buruk dulu
index = [('California', 2000), ('California', 2010),
 ('New York', 2000), ('New York', 2010),
 ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
 18976457, 19378102,
 20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [5]:
# Misal langsung aja membelah datanya
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [6]:
# Jadinya gini, gak efisien
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [7]:
# Cara yang lebih efisien gini
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [8]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [9]:
# Menslice dengan simple
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [10]:
# Multi index sebagai dimensi extra
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [11]:
# kalau di syack
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [12]:
# nambah column ke dataframe
pop_df = pd.DataFrame({'total': pop,
 'under18': [9267089, 9284094,
 4687374, 4318033,
 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [13]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [14]:
# Metode multi index dengan dua atau lebih array
df = pd.DataFrame(np.random.rand(4, 2),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=['data1', 'data2'])
df

        data1     data2
a 1  0.444195  0.817282
  2  0.133360  0.648791
b 1  0.442477  0.547426
  2  0.431059  0.679193

In [15]:
# Maukin dictionary dengan tuple yang cocok
data = {('California', 2000): 33871648,
 ('California', 2010): 37253956,
 ('Texas', 2000): 20851820,
 ('Texas', 2010): 25145561,
 ('New York', 2000): 18976457,
 ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [16]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [17]:
# Kita kontruksi list tuplenya
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [18]:
# bikin kartesian productnya
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [20]:
# Kita multi index langsung
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

TypeError: ignored

In [21]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [22]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
 names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
 names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      15.0  36.7  37.0  37.2  34.0  35.8
     2      26.0  37.8  28.0  35.3  46.0  37.6
2014 1      27.0  37.6  45.0  36.3  39.0  37.1
     2      40.0  36.8  31.0  39.1  42.0  38.0

In [23]:
# Kita lihat data multi index nya
health_data['Guido']

type          HR  Temp
year visit
2013 1      37.0  37.2
     2      28.0  35.3
2014 1      45.0  36.3
     2      31.0  39.1

In [24]:
# ngeakses satu elemennt nya
pop['California', 2000]

33871648

In [26]:
# partial indexing
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [27]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [28]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [29]:
# kita select yg nilainya lebih dari ini
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [30]:
# select dari index kotanya
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [ ]:
# Melihat dataframe multiple index
health_data

In [32]:
# Ngambil data bagin guido aja
health_data['Guido', 'HR']

year  visit
2013  1        37.0
      2        28.0
2014  1        45.0
      2        31.0
Name: (Guido, HR), dtype: float64

In [33]:
# kalo pakai iloc
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      15.0  36.7
     2      26.0  37.8

In [34]:
# kalau pakai loc
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        15.0
      2        26.0
2014  1        27.0
      2        40.0
Name: (Bob, HR), dtype: float64

In [35]:
# ga bisa karena bikin list dalam tuple nya
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: ignored

In [36]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      15.0  37.0  34.0
2014 1      27.0  45.0  39.0

In [38]:
# Ngesortir index
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.204790
      2      0.334205
c     1      0.432859
      2      0.206236
b     1      0.342033
      2      0.611845
dtype: float64

In [39]:
data = data.sort_index()
data

char  int
a     1      0.204790
      2      0.334205
b     1      0.342033
      2      0.611845
c     1      0.432859
      2      0.206236
dtype: float64

In [40]:
# partial slicing
data['a':'b']

char  int
a     1      0.204790
      2      0.334205
b     1      0.342033
      2      0.611845
dtype: float64

In [41]:
# stacking dan unstacking index nya
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [42]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [43]:
# stacking
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [44]:
# ngereset index
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [45]:
# nge set
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [46]:
# Mengaggregasi datafframe multi index
# Lihat dutu data multiindexnya
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      15.0  36.7  37.0  37.2  34.0  35.8
     2      26.0  37.8  28.0  35.3  46.0  37.6
2014 1      27.0  37.6  45.0  36.3  39.0  37.1
     2      40.0  36.8  31.0  39.1  42.0  38.0

In [47]:
# Cari meannya
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     20.5  37.25  32.5  36.25  40.0  36.70
2014     33.5  37.20  38.0  37.70  40.5  37.55

In [48]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  31.000000  36.733333
2014  37.333333  37.483333